In [ ]:
# 빅데이터 분석 기사 실기 시험 준비를 위한 판다스 100제 전체 실습 환경 구성

# 데이터 다운로드 : https://cafe.daum.net/oracleoracle/Smgg/1

import  pandas  as  pd

emp20=pd.read_csv("./datasets/emp20.csv", encoding="euckr")
emp = pd.read_csv("./datasets/emp.csv")
tit = pd.read_csv("./datasets/train.csv")
dept = pd.read_csv("./datasets/dept.csv")
boston = pd.read_csv("./datasets/boston.csv")

- 코랩에서 진행할 경우 주석 해제 후 사용

In [ ]:
# from google.colab import drive
# drive.mount('/content/drive')

In [ ]:
# ▩ 예제1.  판다스 모듈 이란? 

# 판다스(pandas)  모듈(module) ?

# 1.  csv 파일이나 엑셀 파일의 데이터를 검색하기 편하도록  구현한 
#     파이썬  함수들을 모아놓은 코드들의 집합
# 2. 데이터 시각화  함수들이 내장 되어 있습니다. 
# 3. 데이터 분석 함수들이 내장되어 있습니다.
# 4. 기계학습에 필요한 함수들이 내장되어 있습니다. 

# 코드설명 :
import   pandas    as    pd 
#  판다스 모듈(module)  을 지금 이 주피터 노트북 창에 불러와라
# 그리고  앞으로  pandas 라고 안하고 pd 라고 하겠다. 

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
# 판다스의 read_csv 라는 함수를 이용해서 emp.csv 파일을 불러와서
# emp 라는 이름으로  데이터 프레임(테이블)을 생성해라 ~

emp  
# emp 데이터 프레임의 내용을 출력한다.

In [ ]:
# 문제1.판다스 모듈을 이용해서 emp.csv 로 emp 데이터 프레임을 생성하시오 !

# 데이터 다운로드 주소: https://cafe.daum.net/oracleoracle/SDMs/470

import pandas  as pd

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
emp

In [ ]:
#▩ 예제2.   특정 컬럼 출력하기 

# 문법:    데이터프레임명 [  ['컬럼명1', '컬럼명2' ]  ]   

# emp 데이터 프레임에서 이름과 월급을 출력하세요 !

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

emp[ ['ename', 'sal' ]  ]

In [ ]:
#문제2.    사원번호, 이름, 월급, 직업을 출력하시오 !

#답:
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# ▩ 예제3.  특정 검색 조건에 해당하는 데이터 검색하기 

# 문법:  데이터프레임명[ ['컬럼명1', '컬럼명2'] ]  [  검색조건  ]  

# 예제:    월급이 3000 인 사원들의 이름과 월급을 출력하시오

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

emp[ [ 'ename', 'sal' ]  ]  [  emp['sal'] == 3000 ] 

# ※ 비교 연산자   :  >, <, >=, <=, ==,  !=

In [ ]:
# 문제3.  직업이  SALESMAN 인 사원들의 이름과 월급과 직업을 출력하시오 !

#답: 
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# 문제4.  월급이 1200 이상인 사원들의 이름과 월급과 직업을 출력하시오 ! 

#답: 
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
#문제5.   부서번호가 20번인 사원들의 이름과 월급과 부서번호를 출력하시오 !

#답: 
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# ▩ 예제4. 자주 사용하는  기타 비교 연산자 4가지 

# >, <, >=, <=, ==, !=

#           SQL               vs                    판다스 
# 1.  between .. and                 emp['sal'].between(1000, 3000)
# 2.  in                                       emp['deptno'].isin([ 10, 20 ] )      
# 3.  is  null                              emp['comm'].isnull() 
# 4.  like                                   emp['ename'].apply( lambda 함수)

In [ ]:
# 문제6.   월급이 1000 에서 3000 사이인 사원들의 이름과 월급을 출력하시오 !

#답: 
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
#문제7.  월급이 1000 에서 3000 사이가 아닌 사원들의 이름과 월급을 출력하시오 

#답: 
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")



# 판다스에서의 not 은 ~ 입니다.

In [ ]:
# 문제8.  (빅분기 실기 유형1 데이터)  boston.csv 를 boston 이라는
#  데이터 프레임으로 구성하시오 !

# 데이터 다운로드 주소: https://cafe.daum.net/oracleoracle/SDMs/462

#답:

In [ ]:
# 문제9.  boston 데이터 프레임에서  price 가  10 에서 30 사이인 
#                id 와 price 를 출력하시오 ! 

# 힌트: emp[['ename','sal']][ ~ emp['sal'].between(1000,3000)  ]
#답: 
boston = pd.read_csv("/content/drive/MyDrive/data100/boston.csv")

In [ ]:
# 문제10.   문제9번의 결과를 다시 출력하는데 모든 컬럼을 전부 출력하시오 !

#답: 
boston = pd.read_csv("/content/drive/MyDrive/data100/boston.csv")

In [ ]:
# 문제11.  문제10번의 결과를 다시 출력하는데 집값이 10 에서 30 사이가 
# 아닌 모든 컬럼을 출력하시오 ! 

#답: 
boston = pd.read_csv("/content/drive/MyDrive/data100/boston.csv")

In [ ]:
#문제12. emp20.csv 를 emp20 이라는 이름의 데이터 프레임으로 구성하시오 !  

# 데이터 다운로드 주소: https://cafe.daum.net/oracleoracle/SDMs/465

#답: 



#설명:  한글 데이터가 섞인  파일을 파이썬으로 불러올 때는
#           encoding 옵션을 줘야 합니다. 인코딩이란  기계가 이해하는
#           언어로 변환하겠다는 뜻입니다. euckr 은 한글을 이해하는 옵션 입니다.

In [ ]:
# 문제13. 나이가  20대인 학생들의 이름과 나이를 출력하시오 !

#답: 

emp20 = pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
# 문제14.   직업이 SALESMAN, ANALYST 인 사원들의 이름과 직업을  출력하시오 !

#답: 
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
#문제15.  emp20 데이터 프레임에서  통신사가 kt,  lg 인 학생들의 이름과 통신사를 출력하시오 !

#답: 

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
#문제16.  우리반 테이블에서 통신사가 kt,  lg 가 아닌 학생들의 이름과 통신사를 출력하시오 ! 

#답: 
emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
#           SQL              vs                    판다스 
# 1.  between .. and                emp['sal'].between(1000, 3000)
# 2.  in                                      emp['deptno'].isin([ 10, 20 ] )      
# 3.  is  null                             emp['comm'].isnull() 
# 4.  like                                   emp['ename'].apply( lambda 함수)

In [ ]:
#문제17.    커미션이 null(결측치) 인 사원들의 이름과 커미션을 출력하시오 !

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
#문제18.  커미션이 null(결측치) 이 아닌 사원들의 이름과 커미션을 출력하시오 !

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:

        SQL               vs                    판다스 
 1.  between .. and               emp['sal'].between(1000, 3000)
 2.  in                                     emp['job'].isin([ 10, 20 ] )      
 3.  is  null                            emp['comm'].isnull() 
 4.  like                                  emp['ename'].apply( lambda 함수) 

  emp  <---   판다스 데이터 프레임 ( dataframe )  ,  오라클의 테이블
  emp['sal']  <---   판다스 시리즈(series) ,  오라클의 컬럼 

컬럼(시리즈) 의 데이터를 잘 검색할 수  있도록 도와주는 함수들이
여러개가 있습니다.   이 중에 apply 라는 함수가 있습니다. 
apply 함수는 이름 그대로 적용하겠다는 것입니다. 
어떤 조건을 적용해서 데이터를 검색하겠다는 뜻입니다. 

예:  이름의 첫번째 철자가 A 인 사원들의  이름을 출력하시오 !

emp[ ['ename'] ]   [  emp['ename'].apply(  적용할 검색 조건 )  ]  

emp[ ['ename'] ]   [  emp['ename'].apply(  lambda   x : x[0] =='A'  )  ]  
                                                   ADAMS :  'A' =='A'

lambda   x : x[0] =='A'   <--- 이 부분 설명

lambda  -->  이름이 없는 한줄 짜리 함수를 생성할 때 사용하는 키워드 
             lambda 다음에 어떤 기능에 대한 코드를 적어주면 됩니다. 

x : x[0]   --->    입력값을 받은 변수 :  출력을 하는 조건 

x 에 뭐가 입력되냐면  emp['ename'] 의 데이터가 x 라는 변수에 입력됩니다. 

emp['ename']   <--- 이것만 실행해보면  다음과 같이 이름이 출력되는데

아래의 이름 14개가 KING 부터 하나씩 x 라는 변수에 입력이 됩니다.  

0       KING          ---------------->   x  라는 빈컵 
1      BLAKE        ---->  x  :  x[0]  --->  B
2      CLARK       ---->   x : x[0]  --->  C 
3      JONES
4     MARTIN
5      ALLEN
6     TURNER
7      JAMES
8       WARD
9       FORD
10     SMITH
11     SCOTT
12     ADAMS
13    MILLER     ---->  x  :  x[0]    ---->  M 

x 라는 변수에  KING 이 제일 처음 담겼고   출력값으로 x[0] 이 실행되는데 
x 다음에 나오는 [0] 을 인덱스라고 합니다. 

'KING'[0]  이라고  수행한것 입니다.  

KING 이라는 문자열에서  0번째 철자를 가져오라는 뜻입니다. 

파이썬은 1번부터 시작하지 않고 0번부터 시작합니다. 

'KING'[0]    -->  K
'KING'[1]    -->  I
'KING'[2]   -->  N
'KING'[3] ---->  G

In [ ]:
emp[ ['ename'] ]   [  emp['ename'].apply(  lambda   x : x[0] =='A'  )  ]

In [ ]:
#문제19.  이름의 두번째 철자가 M 인 사원들의 이름을 출력하시오 !

#답:

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
emp['ename']

KING
0123

BLA  K   E
    -2  -1

In [ ]:

# 문제20.  이름의 끝글자가 T 로 끝나는 사원들의 이름과 월급을 출력하시오  !

#답:
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# 문제21.  emp20 테이블에서 성씨가  김씨인 학생들의 이름과 나이를 출력하시오 !

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
# 문제22.  성씨가 김씨가 아닌 학생들의 이름과 나이를 출력하시오 !

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
▩ 예제5.  데이터 정렬하기 !  

 * 이름와 월급을 출력하는데  월급이 높은 사원부터 출력하시오 !

Pandas>  emp[ ['ename', 'sal'] ].sort_values( by ='sal',  ascending=False)  

문법:    판다스 데이터프레임(또는 시리즈).sort_values( by='정렬할 컬럼' , ascending=True)
                                                                                              ascending= True 또는 False) 

 True 와 False 를 쓸때는 T 와 F 를 대문자로 해주셔야합니다.

In [ ]:
emp[ ['ename', 'sal'] ].sort_values( by ='sal',  ascending=True)

In [ ]:
# 문제23.  직업이 SALESMAN 인 사원들의  이름과 월급과 직업을 출력하는데 
# 월급이 높은 사원부터 출력하시오 !

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# 문제24. 통신사가 kt 가 아닌 학생들의  이름과 나이와 통신사를 출력하는데
#         나이가 높은  학생부터 출력하시오 !

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
# 문제25.   EMP 데이터 프레임의 구조를 확인하세요 !

#답:

In [ ]:
▩ 예제6. 판다스에서 날짜 데이터 다루기

기본적으로  엑셀 이나 csv 파일을  판다스 데이터 프레임으로 구성하면
날짜 형식이 object 으로 구성됩니다.  즉 문자형 입니다. 그런데
문자형이 아니라 날짜형으로 변환을 해야 날짜 데이터를 검색하기가 수월 합니다. 
날짜형으로 변환하는 작업을 수행해 보겠습니다. 

*  emp 데이터 프레임의 info() 를 확인합니다. 

emp.info() 

0   empno     14 non-null     int64  
 1   ename     14 non-null     object 
 2   job       14 non-null     object 
 3   mgr       13 non-null     float64
 4   hiredate  14 non-null     object   <----  문자로 되어 있습니다. 
 5   sal       14 non-null     int64  
 6   comm      4 non-null      float64
 7   deptno    14 non-null     int64  

* emp 데이터 프레임의 hiredate 를  날짜형으로 변환합니다.

import   pandas  as   pd 
emp['hiredate']  =  pd.to_datetime( emp['hiredate']) 
emp.info() 

※ 판다스 함수중에 to_datetime 함수를 이용해서 emp['hiredate'] 를
     날짜형으로 변환합니다.  변환하고 emp['hiredate'] 에 반영합니다. 

hiredate  14 non-null     datetime64[ns]  <--- 날짜형 데이터 유형으로 변경됨

In [ ]:
import   pandas  as   pd 
emp['hiredate']  =  pd.to_datetime( emp['hiredate']) 
emp.info()

In [ ]:
#문제26.  81년 11월 17일에 입사한 사원들의 이름과 입사일을 출력하시오

#답:

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
#문제27.  81년도에 입사한 사원들의 이름과 입사일을 출력하시오 !

#답:
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# 문제28.  직업이 SALESMAN 이고 1981년도에 입사한 사원들의 이름과 직업과 입사일을 출력하세요

#답:
 
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
▩ 예제7.  중복된 데이터를 제거하는 방법 

* 부서번호를 출력하는데 중복을 제거해서 출력하시오 !

Pandas>  emp['deptno'].unique()

In [ ]:
emp['deptno'].unique()

In [ ]:
#문제29.   타이타닉 데이터의 훈련 데이터인 train.csv 를 불러와서  tit 라는
#                데이터 프레임을 생성하시오 ! 

# 데이터 다운로드 주소:  https://cafe.daum.net/oracleoracle/SDMs/466


#답:

In [ ]:
# 문제30.  tit 데이터 프레임에서  Pclass 를 출력하는데 중복을 제거해서 
#          출력하시오 !

#답 :

tit = pd.read_csv('/content/drive/MyDrive/data100/train.csv')

In [ ]:
# 문제31.  부서번호가 20번인 사원들의 직업을 출력하는데 중복을 제거해서 출력하시오

#답:

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
설명:
type( emp[['job']] [ emp['deptno']==20 ] )

pandas.core.frame.DataFrame

type( emp['job'] [ emp['deptno']==20 ] )

pandas.core.series.Series

대괄호를 2개 썼을때는 데이터 프레임 형태(테이블)로 출력되고 
대괄호를 1개 썼을때는 시리즈(컬럼)  형태로 출력됩니다. 
unique()  함수는 시리즈의 함수입니다. 

emp['job'] [ emp['deptno']==20 ].unique()     <---  이렇게 해야 가능

emp[['job']] [ emp['deptno']==20 ].unique()   <--- 이렇게 하면 에러남

In [ ]:
#문제32. emp20 데이터 프레임에서 통신사가 sk, kt 인 학생들의 나이를 출력하는데 
#        중복을 제거해서 출력하시오 !


#답:

import pandas as pd

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
# ※   tip 
# 
emp20['age'] [  emp20.telecom.isin( ['sk', 'kt'] )  ].unique()

In [ ]:
▩ 예제8. 문자 함수 다루기1 ( 대문자로 변환하기 )

            SQL                        vs                   파이썬
           upper                                             문자열.upper()
           lower                                             문자열.lower() 
           initcap                                           문자열.captialize()
           substr                                            문자열.slice()
           length                                            len(문자열)
           ltrim                                             문자열.lstrip()
           rtrim                                             문자열.rtrip() 
           replace                                           문자열.replace()  
           instr                                             문자열.find()  

* 타이타닉호의  승객 이름을  대문자로 출력하시오 !

tit['Name'].str.upper()

설명:  시리즈를 str(문자형) 으로 변환하고 파이썬의 문자형 함수인 upper()
       를 사용해서 대문자로 출력하겠다. 

tit['Name'].upper()   <---  시리즈에는 upper() 함수가 없습니다. 
                           반드시 str 을 써서 문자형으로 변환하고 
                            파이썬 문자를 쓰겠다고 해줘야합니다.

tit['Name'].str.upper()     또는   tit.Name.str.upper()

In [ ]:
#문제33.  emp20 에서 통신사를 출력하는데  통신사를 대문자로 출력하시오 ! 

#답:
emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
#문제34.  위의 결과를 다시 출력하는데  이름과 통신사를 출력하고
#         통신사를 대문자로 출력하시오 ! 

#답:

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")


#또는 

#pd.concat( [emp20.ename,  emp20.telecom.str.upper() ], axis=1  ) 

#※ pd 의 concat(  [  시리즈1,  시리즈2 ],  axis = 1 ) 

# axis=1 은 양옆으로 붙이는 것,  axis=0 은 위아래로  붙입니다.

In [ ]:
#▩ 예제9. 문자 함수 다루기2( 소문자로 변환하기 )

#* emp 데이터 프레임에서 이름을 출력하는데 소문자로 출력하시오 !

emp.ename.str.lower()

In [ ]:
#문제35.  이름과 월급을 출력하는데 이름을 소문자로 출력하시오 !

#답:

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# 문제36. 이름이 scott 인 사원의 이름과 월급을 출력하는데 이름을 소문자로 검색해도
#  출력되게 하시오 !

#답:
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
#▩ 예제10. 문자 함수 다루기3 (첫번째 철자를 대문자로  변환하기 )

emp.ename.str.capitalize()

In [ ]:
#문제37. 이름과 통신사를 출력하는데 통신사를 출력할 때 첫번째 철자는
#        대문자로 출력하고 나머지는 소문자로 출력하시오 ! 

#답: 

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
▩ 예제11. 문자 함수 다루기4 ( 문자열 잘라내기 ) 

*  이름의 첫번째 철자만 출력하시오 !

Pandas>  emp.ename.str.slice( start=0,  stop=1)

   start= 0 은  0번째 자리부터 시작해서 stop=1 은  1 번째 자리 미만까지

In [ ]:
emp.ename.str.slice( start=0,  stop=1)

In [ ]:
#문제38.  이름을 출력하는데 이름의 첫번째 철자 부터 두번째 철자까지만 출력하시오

#답:

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# 문제39.   emp20 에서 성씨가 김씨인 학생들의 이름과 나이를 출력하시오 !

#답: 

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
# 문제40.  emp20 테이블에서 서울에서 거주하지 않는 학생들의 이름과 나이와
#          주소를 출력하는데 나이가 높은 학생부터 출력되게 하시오 !

#답:
emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
▩ 예제12. 문자 함수 다루기5 ( len ) 

  len 함수는  파이썬에 내장되어있는 문자 함수이고 문자열의 철자의 갯수를 세는 함수 

예:     a =  'scott'
        len(a)  # 5

* 이름과  이름의 철자의 갯수를 출력하시오 !

Pandas> pd.concat( [ emp.ename,   emp.ename.str.len() ] , axis=1   )

또는

Pandas>  emp['ename_len'] =  emp.ename.str.len()
         emp[ ['ename', 'ename_len'] ]

In [ ]:
emp['ename_len'] =  emp.ename.str.len()
emp[ ['ename', 'ename_len'] ]

In [ ]:
# 문제41.  이름과 이름의 철자의 갯수를 출력하는데 이름의 철자의 길이가 가장 긴 사원부터 출력하시오 !

#답:
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
tit

In [ ]:

#문제42. 타이타닉 데이터 프레임(tit)  에서  승객이름과 이름의 철자의 길이를
#        출력하는데 이름의 철자의 길이가 긴 승객부터 출력하시오 !

#답:
tit = pd.read_csv("/content/drive/MyDrive/data100/train.csv")

In [ ]:
▩ 예제13. 문자 함수 다루기6 ( find ) 

 find 함수는  문자열에서 특정 철자의 위치 인덱스 번호를 출력하는 함수 

예:   a ='smith'
      a.find('m')    #    1  

find 함수를 통해서 문자열에 없는 철자를 찾으려고 시도하면 -1을 출력합니다.

In [ ]:
a ='smith'
a.find('k')

In [ ]:
emp.ename.str.find('M')

In [ ]:
#문제43.  emp 데이터 프레임에서 이름에 M 자가 포함된 사원들의 이름과 월급을
#         출력하세요

#답: 

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# 문제44. emp 데이터 프레임에서 이름에 M 자가 포함되지 않은 사원들의 이름과 월급을
#         출력하세요

# 답:

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
▩ 예제14. 문자 함수 다루기7 ( replace ) 

 파이썬 내장함수인 replace 는 문자열에서 특정 철자를 다른 철자로
 변경하는 함수 입니다.

예:  a = 'scott' 
     a.replace('s', 'k')   # kcott

In [ ]:

# 문제45. 이름과 월급을 출력하는데  월급을 출력할 때 숫자 0 을  별표(*) 로 출력하시오

# 답:

emp = pd.read_csv("/content/drive/MyDrive/data500/emp.csv")

In [ ]:
#문제46.  위의 경우는 * 이  0 이라는 것을 알면 보안이 뚫리므로 
#         이번에는 월급을 출력할 때 숫자 0~ 3까지의 숫자를 * 로 출력하시오

# regular   expression (정규 표현식)  함수중에 regexp_replace 라는 함수가
#  있는데  replace 함수의 더 확장된 함수 입니다. 

# 답:
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

import  re # 데이터 전처리 전문 모듈


# 파이썬 :   re.sub( '[0-3]', '*',  sal )

In [ ]:

▩ 예제15. 문자 함수 다루기8 ( strip ) 

strip 함수는 문자열에 존재하는 특정 철자나 특수문자 또는 공백문자를
잘라내는 함수 

함수                  설명 
lstrip()               문자열에서 존재하는 왼쪽 공백을 제거
rstrip()               문자열에서 존재하는 오른쪽 공백을 제거        
strip()                문자열에서 존재하는 양쪽 공백을 제거 

예제:    text7 =  '          A  story   is   2023            ' 
         print(text7)
         print( text7.lstrip()   ) 
         print( text7.rstrip()   )
         print( text7.strip()   )

In [ ]:
text7 =  '          A  story   is   2023            ' 
print(text7)
print( text7.lstrip()   ) 
print( text7.rstrip()   )
print( text7.strip()   )

In [ ]:
# 문제47.  emp.csv 파일에 JACK 데이터를 입력하는데 양쪽에 공백을 입력해서 넣고
#  이름이 jack 인 사원의 이름과 월급을 출력하세요 !

# 답:
emp2 = pd.read_csv("/content/drive/MyDrive/data100/emp2.csv")

In [ ]:
▩ 예제16.   최대값 출력하기 (max) 
  
        SQL               vs                  판다스 
       max                                      emp['sal'].max()
       min                                      emp['sal'].min()
       sum                                      emp['sal'].sum()
       avg                                      emp['sal'].mean()
       count                                    emp['sal'].count() 

예제.  emp 데이터 프레임에서 최대 월급을 출력하시오 !

emp['sal'].max()

In [ ]:
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

emp['sal'].max()

In [ ]:
# 문제48.   emp20 에서 최대 나이를 출력하시오 !

# 답:
emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
#문제49.  부서번호가 20번인 사원들의 최대월급을 출력하시오

# 답:

emp=pd.read_csv('/content/drive/MyDrive/data100/emp.csv')

In [ ]:
# 문제50. 직업이 SALESMAN 인 사원들의 최대월급을  출력하시오 ! 

# 답:
emp=pd.read_csv('/content/drive/MyDrive/data100/emp.csv')

In [ ]:
# 문제51. 직업과 직업별 최대월급을 출력하세요

# 답:

import pandas as pd

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
설명:  
groupby 와 reset_index() 는 서로 짝꿍입니다.
groupby 만 사용하면 결과가 Series(컬럼) 로 나오고 
reset_index() 를 뒤에 붙여줘야  data Frame(테이블) 으로 
출력됩니다.

In [ ]:
#문제52. tit 에서 Pclass 를 출력하고 Pclass 별 최대운임을 출력하시오 !
#       ( 운임은 Fare ) 

# 답:

tit = pd.read_csv("/content/drive/MyDrive/data100/train.csv")

In [ ]:
# 문제53. emp20 테이블에서 통신사, 통신사별 최대나이를 출력하는데
#        최대나이가 높은 것부터 출력하시오 !

# 답:

emp20 = pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
# 문제54.  문제53번의 컬럼명을 변경하시오 !

# 답:
emp20 = pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:

# ▩ 예제17.   최소값 출력하기 (min) 

# *  직업, 직업별 최소월급을 출력하시오 !

# 답:
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:

# 문제55. 직업, 직업별 최소월급을 출력하는데  최소 월급이 낮은것부터 출력하시오

# 답:
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:

# 문제56. 직업, 직업별 최소월급을 출력하는데 직업별 최소월급이
#         1200 이상인것만 출력하시오


#답: 

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# ▩ 예제18.   토탈값  출력하기 (sum) 

# 부서번호와 부서번호별 토탈월급을 출력하세요 

emp.groupby('deptno')['sal'].sum().reset_index()

In [ ]:

# 문제57. 직업과 직업별 토탈월급을 출력하는데 직업별 토탈월급이
# 높은 사원부터 출력하세요


#답 :

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:

# 문제58. 직업과 직업별 토탈월급을 출력하는데 직업이 SALESMAN은
# 제외하고 출력하고 직업별 토탈월급이 높은 사원부터 출력하세요


#답: 
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# 문제59. 직업과 직업별 토탈월급을 출력하는데 직업이 SALESMAN은
# 제외하고 출력하고 직업별 토탈월급이 5000 이상인것만 출력하고 
# 직업별 토탈월급이 높은 사원부터 출력하세요

# SQL>    select   job  as   직업,  sum(sal)    as  토탈월급
#                  from    emp
#                  where     job   != 'SALESMAN' 
#                  group    by    job 
#                  having   sum(sal)  >=  5000
#                  order   by    토탈월급    desc; 

#답 :
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:

# ▩ 예제19.   평균값  출력하기 (mean) 

#  사원 테이블의 월급의 평균값을 출력하시오 !

emp['sal'].mean()

In [ ]:

# 문제60.  입사일에서  년도만 추출하시오 !

import pandas as pd

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
설명:

emp.hiredate.dt.year  # 입사일에서 년도만 추출 

※    emp.hiredate.dt.year   :  년도
      emp.hiredate.dt.month   :  달
      emp.hiredate.dt.day  :   일

In [ ]:
emp.hiredate.dt.day

In [ ]:

# 문제61.  사원 데이터 프레임에 컬럼을 하나 추가하는데  hire_year 로
#         추가하고  입사한 년도가  들어가게 하시오 !

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:

# 문제62.   년도(hire_year) ,  년도별 평균월급을 출력하시오 !

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:

# 문제63.  입사한 년도, 입사한 년도별 평균월급을 출력하는데
# 입사한 년도별 평균월급이 높은것 부터 출력하시오.

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:

▩ 예제20.  건수 출력하기 ( count )

    SQL              vs                  판다스 
    max                                emp['sal'].max()
    min                                emp['sal'].min()
    sum                                emp['sal'].sum()
    avg                                emp['sal'].mean()
    count                              emp['sal'].count()

In [ ]:
emp

In [ ]:
# 직업과 직업별 인원수를 출력하세요

emp.groupby('job')['empno'].count().reset_index()

In [ ]:
# 문제64. 직업, 직업별 인원수를 출력하는데 직업별 인원수가
#  3명 이상인것만 출력하세요

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# ▩ 예제21.  컬럼 두개로 group by 하기 

# 부서번호별 직업별 토탈월급을 출력하세요

emp.groupby(['deptno', 'job'])['sal'].sum().reset_index()

In [ ]:
# 문제65. emp20 에서 주소를 출력하는데  앞에 3글자만 출력하시오

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:

# 문제66.  위의 결과를 담는 컬럼을 address2 라는 이름으로 생성하시오 !

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:

# 문제67.   address2 를 출력하고 address2 별 인원수를 출력하시오 !

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:

# 문제68.  통신사,address2 , 통신사별 address2 별 인원수를 출력하시오

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:

# ▩ 예제22.  순위를 출력하는 rank 함수 배우기 

# 이름과 월급과 월급에 대한 순위를 출력하세요

emp['순위'] = emp['sal'].rank(ascending=False).astype(int)
emp[['ename', 'sal', '순위']].sort_values( by ='순위', ascending=True )

In [ ]:
# 문제69. 이름,  나이,  나이에 대한 순위를 출력하시오 !

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
# 문제70. 직업이 SALESMAN인 사원들의 이름과 월급과 직업과
#         월급에 대한 순위를 출력하세요 

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# 문제71.  부서번호, 이름, 월급, 월급에 대한 순위를 출력하는데
# 순위가 부서번호별로 각각 월급이 높은 순서데로 순위가 부여되게
# 하세요.

import pandas as pd 

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
#문제72.  우리반 테이블에서 통신사, 이름, 나이, 순위를 출력하는데
#         순위가 통신사별로 각각 나이가 높은 순서대로 순위를 부여하시오


emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:

# ▩ 예제23.  등급을 나누는  함수(qcut 함수)

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# 문제73.   이름과 나이와  등급을 출력하는데  나이를 5등급으로 나눠서
#           등급을 출력하시오 !

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:

# 문제74.  타이타닉의 Age 의 null 값을  나이의 평균값으로 채워넣으시오 !

tit = pd.read_csv('/content/drive/MyDrive/data100/train.csv')

In [ ]:
#문제75.   타이타닉 데이터 프레임에서 Age 와 순위를 출력하는데 순위가
#           Age 가 높은 순서데로 순위를 부여하시오 !

In [ ]:
#문제76.  타이타닉의  Age 컬럼을  age_grade 라는 컬럼을 추가하고
#         등급을 4등급으로 나누시오 (1~4)

# 참고 코드: emp20['age_grade'] = pd.qcut( emp20.순위, q=cuts  )

In [ ]:
# ▩ 예제24. 그룹 별로 가로로 출력하는 오라클 listagg 를 파이썬으로 구현하기 

emp.groupby('deptno')['ename'].apply(list).reset_index(name='employee' )

In [ ]:
#문제77.  통신사, 통신사별 학생 이름을 가로로 출력하시오 


emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
# ▩ 예제25.  그 전행과 그 다음행을 출력하기 

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

emp['sal_lag']  =  emp['sal'].shift(1).fillna(0).astype(int)  # 월급을 아래로 한칸 이동
emp['sal_lead']  = emp['sal'].shift(-1).fillna(0).astype(int) # 월급을 위로 한칸 이동

emp[ ['ename', 'sal', 'sal_lag', 'sal_lead'] ]

In [ ]:
#문제78.  이름, 입사일, 바로전행의 입사일을 출력하세요

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# ▩ 예제26.   pivot  을 이용해서 데이터 회전 시키기 

#     행 ----------->  컬럼  :   pivot 

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

result =emp.pivot_table( columns='deptno',  values='sal',  aggfunc='sum')
result.style.hide_index()

In [ ]:
#문제79. 직업과 직업별 토탈월급을 출력하는데 아래와 같이 출력되게 하세요.

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:
# 문제80.직업, 부서번호, 직업별 부서번호별 토탈월급을 출력하시오 !

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

In [ ]:

# 문제81.   우리반 테이블(emp20)에서  주소 컬럼의 앞글자 3글자를 담는 파생변수를
#           address_front_3 이라는 컬럼으로 생성하시오 ! 

import pandas as pd

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:
#문제82.   address_front_3 을 출력하고 address_front_3 별 인원수를 가로로
#          출력하시오 !

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

In [ ]:

▩ 예제27.  SQL의  조인을 판다스로 구현하기 

         SQL                    vs                    판다스 

equi  join
non equi  join                                        pd.merge 함수 
outer   join
self   join

In [ ]:

#문제83.   dept.csv 를  dept  데이터 프레임으로 구성하시오 !

dept = pd.read_csv("/content/drive/MyDrive/data100/dept.csv")
dept

In [ ]:
#문제84. 이름과 부서위치를 출력하세요

#답:
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
dept = pd.read_csv("/content/drive/MyDrive/data100/dept.csv")


import pandas  as  pd

In [ ]:
# 문제85.  직업이 SALESMAN인 사원들의 이름과 부서위치를 출력하세요.

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
dept = pd.read_csv("/content/drive/MyDrive/data100/dept.csv")

In [ ]:
# 문제86. 월급이 1000 에서 3000 사이인 사원들의 이름과 부서위치와
#         월급을 출력하세요.

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
dept = pd.read_csv("/content/drive/MyDrive/data100/dept.csv")

In [ ]:
#문제87. 월급이 1000 에서 3000 사이이고 직업이 SALESMAN인 사원들의
#        이름과 부서위치와 월급과 직업을 출력하세요.


#* 논리 연산자  :      1.  and      -------->    &
#                      2.  or       --------->   &&
#                      3.  not     ---------->  ~

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
dept = pd.read_csv("/content/drive/MyDrive/data100/dept.csv")

In [ ]:
▩ 예제28.  SQL의 아우터  조인을 판다스로 구현하기 


pd.merge(  emp, dept,  on='deptno',  how='inner' )  

how='right'   는 dept 테이블 쪽의 데이터가 모두 나오게 해라!
how='left'    는  emp 테이블 쪽의 데이터가 모두 나오게 해라 !
how='outer'   는  오라클의 full outer 조인과 똑같습니다. (양쪽의 데이터가 모두
                     다 나오게 해라 )
how='inner'    는 오라클의  equi  join 과 똑같습니다.

In [ ]:
#문제88. 이름과 부서위치를 출력하는데 부서위치에 BOSTON도 
#        같이 출력하세요

# select  e.ename,  d.loc
#    from   emp   e,   dept    d
#    where    e.deptno (+) = d.deptno ;

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
dept = pd.read_csv("/content/drive/MyDrive/data100/dept.csv")

In [ ]:
#문제89. 아래의 SQL을 판다스로 구현하세요 


# select  e.ename,  d.loc
#    from   emp   e,   dept    d
#    where    e.deptno = d.deptno (+) ;

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
dept = pd.read_csv("/content/drive/MyDrive/data100/dept.csv")

In [ ]:
#문제90.  아래의 SQL을 판다스로 구현하시오

# select  e.ename,  d.loc
#  from   emp   e    full   outer    join    dept    d
#   on   ( e.deptno = d.deptno );

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
dept = pd.read_csv("/content/drive/MyDrive/data100/dept.csv")

In [ ]:
# 문제91.  부서위치, 부서위치별 토탈월급을 출력하세요

# select   d.loc,   sum(e.sal)
#   from   emp   e,   dept   d
#   where   e.deptno = d.deptno
#   group    by   d.loc; 

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
dept = pd.read_csv("/content/drive/MyDrive/data100/dept.csv")

emp_dept =  pd.merge( emp, dept, on='deptno', how='inner')
result = emp_dept.groupby('loc')['sal'].sum().reset_index()
result.columns = ['부서위치','토탈월급']
result

In [ ]:
# 문제92. 부서명, 부서명별 평균월급을 출력하세요

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
dept = pd.read_csv("/content/drive/MyDrive/data100/dept.csv")

emp_dept =  pd.merge( emp, dept, on='deptno', how='inner')
result = emp_dept.groupby('dname')['sal'].mean().reset_index()
result.columns = ['부서명','평균월급']
result

In [ ]:

▩ 예제29.  판다스의 집합 연산자  

             SQL                          vs                 판다스 

1.  union   all                                             pd.concat 
2.  union                                                   pd.concat + drop_duplicates()
3.  intersect                                              아래의 코드 
4.  minus                                                  아래의 코드

In [ ]:


#문제93. emp 데이터 프레임에서 부서번호가 10번, 20번인 사원들의 이름과 월급과 부서번호를 출력하고 
#        그 밑에 바로 부서번호가 10번인 사원들의 이름과 월급과 부서번호를 출력하시오

"""
select  ename, sal, deptno
   from   emp
   where   deptno   in ( 10, 20 )
union   all
  select   ename, sal, deptno
   from  emp
   where   deptno = 10;
   """

# union all 은 그냥 위의  sql 의 결과와 밑의 sql 의 결과를 하나로 합쳐서 출력합니다. 

emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")

x1 = emp[['ename','sal','deptno']] [ emp['deptno'].isin([10,20]) ]
x2 = emp[['ename','sal','deptno']] [ emp['deptno']== 10 ]
pd.concat([x1,x2], axis=0)

# 설명 : axis = 0  은 위아래로 연결( 기본값)
#        axis= 1 은 양옆으로 연결

In [ ]:

# 문제94. 통신사가 kt, lg 인 학생들의 이름과 나이와 통신사를 출력하고 
#         그 밑에 통신사가 sk, lg 인 학생들의 이름과 나이와 통신사를 출력하시오   

"""
select    ename,  age,  telecom
   from   emp20
   where   telecom  in ( 'kt', 'lg')
union  all
select  ename, age, telecom
   from   emp20
   where    telecom in  ('sk', 'lg')  ;

"""
#답: 

emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

x1=emp20[['ename','age','telecom']] [ emp20.telecom.isin(['kt','lg']) ]
x2=emp20[['ename','age','telecom']] [ emp20.telecom.isin(['sk','lg']) ]
pd.concat([x1, x2], axis=0)

In [ ]:

# 문제95.  문제94번의 통신사가 kt, lg 인 학생들의 이름과 나이와 통신사를 출력하고 
#         그 밑에 통신사가 sk, lg 인 학생들의 이름과 나이와 통신사를 출력하는데 
#         중복되는 행(row) 은 제거하고 출력하시오


"""
select    ename,  age,  telecom
   from   emp16
   where   telecom  in ( 'kt', 'lg')
union 
select  ename, age, telecom
   from   emp16
   where    telecom in  ('sk', 'lg')  ;
"""
#답:
emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

x1=emp20[['ename','age','telecom']] [ emp20.telecom.isin(['kt','lg']) ]
x2=emp20[['ename','age','telecom']] [ emp20.telecom.isin(['sk','lg']) ]
pd.concat([x1, x2], axis=0).drop_duplicates()

In [ ]:
emp_old_backup = pd.read_csv("/content/drive/MyDrive/data100/emp_old_backup.csv")
emp_old_backup

In [ ]:

#문제96. 아래의  SQL을 판다스로 구현하시오


"""
select  ename, sal, deptno
   from   emp
minus 
  select   ename, sal, deptno
   from  emp_old_backup
"""

#답:
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
emp_old_backup = pd.read_csv("/content/drive/MyDrive/data100/emp_old_backup.csv")

# 설명:  x1.ename.isin(x2.ename)==True  이면 ?  x1 과 x2 의 교집합이 출력
#        x1.ename.isin(x2.ename)==False 이면 ?  x1 과 x2 의 차집합이 출력
#                                               x1 에는 존재하는데 x2 에는 없는
#                                               데이터가 출력됨

x1 = emp[['ename','sal','deptno']]
x2 = emp_old_backup[['ename','sal','deptno']]
x1[:] [ x1.ename.isin(x2.ename)==False]

In [ ]:

#문제97. 아래의 SQL을 판다스로 구현하시오

"""
select    ename,  age,  telecom
   from   emp20
   where  telecom  in ('kt', 'lg')
minus
select  ename, age, telecom
   from   emp20
   where  telecom in ('sk', 'lg');
"""
#답:
emp20=pd.read_csv("/content/drive/MyDrive/data100/emp20.csv", encoding="euckr")

x1 = emp20[['ename', 'age', 'telecom']] [  emp20.telecom.isin(['kt', 'lg'])  ]  
x2 = emp20[['ename', 'age', 'telecom']] [  emp20.telecom.isin(['sk', 'lg'])  ]  
x1[:] [ x1.ename.isin(x2.ename)==False]

In [ ]:

#문제98.  아래의 SQL을 판다스로 구현하시오

"""
select  ename, sal, deptno
   from   emp
intersect
  select   ename, sal, deptno
   from  emp_old_backup
"""
#답:
emp = pd.read_csv("/content/drive/MyDrive/data100/emp.csv")
emp_old_backup = pd.read_csv("/content/drive/MyDrive/data100/emp_old_backup.csv")

x1 = emp[['ename','sal','deptno']]
x2 = emp_old_backup[['ename','sal','deptno']]
x1[:] [ x1.ename.isin(x2.ename)==True]

In [ ]:
#문제99. 위의 csv 파일을 불러와서 market_2017 과 market_2022  데이터 프레임을 생성하시오 !

#공공 데이터 포털 서울시 소상공인 데이터 검색

market_2017 = pd.read_csv("/content/drive/MyDrive/data100/market_2017.csv", encoding='cp949')

market_2022 = pd.read_csv("/content/drive/MyDrive/data100/market_2022.csv", encoding='cp949')

market_2022

In [ ]:
#문제100.  2017년도에는 존재했는데 2022년도에 사라진 편의점의 갯수는 몇개인가?

x1 = market_2017[['상가업소번호']] [ market_2017['상권업종소분류명']=='편의점']
x2 = market_2022[['상가업소번호']] [ market_2022['상권업종소분류명']=='편의점']
x3  = x1[:] [ x1.상가업소번호.isin(x2.상가업소번호) == False ] 
x3[['상가업소번호']].count()